In [27]:
#Renomeie as Colunas e Valores do seguinte DataFrame

In [28]:
import pandas as pd

In [29]:
population = (
{
'Country': ['Belgium', 'India', 'Japan'],
'Population': [12345, 67891011, 98765]
})

In [30]:
data = pd.DataFrame(population)
data

   Country  Population
0  Belgium       12345
1    India    67891011
2    Japan       98765

In [31]:
data.columns

Index(['Country', 'Population'], dtype='object')

In [32]:
rename_columns = {
    'Country' : 'País',
    'Population' : 'População'
}

In [33]:
data.rename(columns = rename_columns, inplace = True)

In [35]:
data

      País  População
0  Belgium      12345
1    India   67891011
2    Japan      98765

In [40]:
data['País'].unique()

array(['Belgium', 'India', 'Japan'], dtype=object)

In [41]:
pais = {
    'Belgium' : 'Bélgica',
    'India' : 'India',
    'Japan' : 'Japão'
}

In [43]:
data['País'].map(pais)

0    Bélgica
1      India
2      Japão
Name: País, dtype: object

In [44]:
data['País'] = data['País'].map(pais)

In [45]:
data

      País  População
0  Bélgica      12345
1    India   67891011
2    Japão      98765